lst_1 = [1, 2, 5, 7, 9, 99, 87, 200, 39, 2]
lst_2 = [5, 42, 29, 345, 50, 33, 7, 0, 201, 9, 2, 132, 45, 23,934]
x = ''
print('Значення   Кількість входжень')
for i in range(len(lst_1)):
    cnt = 0
    for j in range(len(lst_2)):
        if lst_1[i] == lst_2[j]:
            cnt += 1
    #  Тут можна розкоментувати, якщо поставити коменти на рядку № 4 та № 20
    #         if cnt == 1:
    #             x = 'раз'
    #         elif cnt == 2 or cnt == 3 or cnt == 4:
    #             x = 'рази'
    #         else:
    #             x = 'разів'
    #     elif cnt == 0:
    #         x = 'разів'
    # print(f'{lst_1[i]:{3}} зустрічається {cnt} {x} у списку!')
    print(f'{lst_1[i]:{5}}    \t\t\t{cnt}')
